In [1]:
import os
import pandas as pd
import numpy as np

In [2]:
cars = os.path.join("..","electric_cars","vehicle-fuel-type-count-by-zip-code.csv")
geocodes_raw = os.path.join("..","electric_cars","fips_zip_x.csv")
cars_data = pd.read_csv(cars)
geocodes = pd.read_csv(geocodes_raw)
cars_data.head()

,Date,Zip Code,Model Year,Fuel,Make,Duty,Vehicles
0,10/1/2018,90000,2006,Gasoline,OTHER/UNK,Light,1
1,10/1/2018,90000,2014,Gasoline,OTHER/UNK,Light,1
2,10/1/2018,90000,2016,Gasoline,OTHER/UNK,Light,1
3,10/1/2018,90000,2017,Gasoline,OTHER/UNK,Light,1
4,10/1/2018,90000,<2006,Diesel and Diesel Hybrid,OTHER/UNK,Heavy,55

In [3]:
cars_data['Vehicles'].sum()

30411713

In [4]:
geocodes.dtypes
#geocodes["Zip Code"].astype(str)

Unnamed: 0    int64
ZCTA5         int64
STATE         int64
COUNTY        int64
dtype: object

In [5]:
geocodes.head()

   Unnamed: 0  ZCTA5  STATE  COUNTY
0       40738  89010      6      51
1       40748  89019      6      27
2       40749  89019      6      71
3       40774  89060      6      27
4       40776  89061      6      27

In [6]:
#num_schools=school_data_complete["school_name"].nunique()
cars_description = cars_data["Fuel"].unique()
print(cars_description)

['Gasoline' 'Diesel and Diesel Hybrid' 'Battery Electric' 'Other'
 'Flex-Fuel' 'Hybrid Gasoline' 'Natural Gas' 'Plug-in Hybrid'
 'Hydrogen Fuel Cell']

In [7]:
geocodes =geocodes.rename(columns={"ZCTA5":"Zip Code"})
cars_data =cars_data.rename(columns={'Zip Code': 'Zip Code'})

In [8]:
cars_merge_county = pd.merge(cars_data, geocodes, how="inner", on=["Zip Code"])

In [9]:
cars_merge_county
cars = cars_merge_county.dropna()
cars.head()

,Date,Zip Code,Model Year,Fuel,Make,Duty,Vehicles,Unnamed: 0,STATE,COUNTY
0,10/1/2018,90001,2006,Diesel and Diesel Hybrid,FORD,Heavy,16,40937,6,37
1,10/1/2018,90001,2006,Diesel and Diesel Hybrid,OTHER/UNK,Heavy,23,40937,6,37
2,10/1/2018,90001,2006,Diesel and Diesel Hybrid,OTHER/UNK,Light,9,40937,6,37
3,10/1/2018,90001,2006,Battery Electric,OTHER/UNK,Light,1,40937,6,37
4,10/1/2018,90001,2006,Flex-Fuel,CHEVROLET,Light,41,40937,6,37

In [10]:
cars_cleaned = cars.drop(columns=['Date', 'Model Year', 'Make', 'Duty', 'Unnamed: 0', 'STATE', 'Zip Code'])
cars_cleaned.head()

                       Fuel  Vehicles  COUNTY
0  Diesel and Diesel Hybrid        16      37
1  Diesel and Diesel Hybrid        23      37
2  Diesel and Diesel Hybrid         9      37
3          Battery Electric         1      37
4                 Flex-Fuel        41      37

In [11]:
battery_electric = cars_cleaned[cars_cleaned['Fuel']=="Battery Electric"]
plug_in = cars_cleaned[cars_cleaned['Fuel']=="Plug-in Hybrid"]
hybrid = cars_cleaned[cars_cleaned['Fuel']=='Hybrid Gasoline']
batt_car_total = battery_electric['Vehicles'].sum()
hybrid_total=hybrid['Vehicles'].sum()
plug_in_total = plug_in['Vehicles'].sum()
print(hybrid_total)
#cars['Vehicles'].sum()

1118539

In [16]:
# vechicle count per county
veh_per_cnty = cars_cleaned.groupby('COUNTY')['Vehicles'].count()
veh_per_cnty

COUNTY
1       21857
3         306
5        1598
7        4239
9        2261
11       1006
13      19349
15        621
17       4189
19      14688
21        917
23       4167
25       3756
27        951
29      12273
31       2571
33       2318
35       1290
37     126521
39       3007
41       6576
43       1316
45       3483
47       5788
49        794
51        886
53       8394
55       3008
57       2591
59      43273
61       8176
63       1401
65      32252
67      20688
69       1730
71      28775
73      42682
75       9583
77      11917
79       6919
81      11593
83       7595
85      28109
87       4779
89       4233
91        562
93       2199
95       6769
97       9534
99       8219
101      2591
103      2555
105       897
107      9034
109      2185
111     14279
113      4562
115      2311
Name: Vehicles, dtype: int64

In [12]:
counties = cars_cleaned["COUNTY"].unique()
print(counties)

[ 37 111  59  71  65  73  25  27  83  31 107  29  19  53  69  79  51  39
  43  47  81  85  75   1  55  13  95  97  67  41  87  77   9   3 109  99
  45  33  23 105  15  93   5  57  61 113  17 101  11 115   7  91  63  21
 103  89  35  49]

In [13]:
grouped_county = cars_cleaned.groupby(['COUNTY'])
grouped_county.head()

                            Fuel  Vehicles  COUNTY
0       Diesel and Diesel Hybrid        16      37
1       Diesel and Diesel Hybrid        23      37
2       Diesel and Diesel Hybrid         9      37
3               Battery Electric         1      37
4                      Flex-Fuel        41      37
...                          ...       ...     ...
577459  Diesel and Diesel Hybrid         1      49
577460  Diesel and Diesel Hybrid         2      35
577461  Diesel and Diesel Hybrid         2      49
577462                  Gasoline        15      35
577463                  Gasoline        15      49

[290 rows x 3 columns]

In [14]:
cars['Vehicles'].sum()

32288952

In [15]:
#cars data has 584338 observations
#after merge there are 590123
#there are an additional .98% observations

len(cars_data)

584338

In [29]:
cars_cleaned.head(3)

                       Fuel  Vehicles  COUNTY
0  Diesel and Diesel Hybrid        16      37
1  Diesel and Diesel Hybrid        23      37
2  Diesel and Diesel Hybrid         9      37

In [26]:
total_vehicles = cars_cleaned['Vehicles'].sum()
total_vehicles

32288952

In [27]:
v_count_per_type = cars_cleaned.groupby('Fuel')['Vehicles'].sum()
v_count_per_type

Fuel
Battery Electric              234313
Diesel and Diesel Hybrid     1318442
Flex-Fuel                    1324826
Gasoline                    28032565
Hybrid Gasoline              1118539
Hydrogen Fuel Cell              5296
Natural Gas                    33506
Other                           7837
Plug-in Hybrid                213628
Name: Vehicles, dtype: int64

In [28]:
v_pct_per_type = 100 * v_count_per_type / total_vehicles
v_pct_per_type

Fuel
Battery Electric             0.725675
Diesel and Diesel Hybrid     4.083260
Flex-Fuel                    4.103032
Gasoline                    86.817822
Hybrid Gasoline              3.464154
Hydrogen Fuel Cell           0.016402
Natural Gas                  0.103769
Other                        0.024271
Plug-in Hybrid               0.661613
Name: Vehicles, dtype: float64

In [32]:
# Battery Elec % per County
tot_v_per_county = cars_cleaned.groupby('COUNTY')['Vehicles'].sum()
tot_v_per_county[:10]

COUNTY
1     1271376
3        6744
5       43434
7      201388
9       56092
11      22563
13    1067055
15      20285
17     172562
19     718957
Name: Vehicles, dtype: int64

In [35]:
# Battery Elec df
condition = cars_cleaned['Fuel'] == 'Battery Electric'
be = cars_cleaned[condition]
be[:5]

                 Fuel  Vehicles  COUNTY
3    Battery Electric         1      37
65   Battery Electric         1      37
192  Battery Electric         1      37
220  Battery Electric         1      37
279  Battery Electric         1      37

In [36]:
be_count_per_county = be.groupby('COUNTY')['Vehicles'].sum()
be_count_per_county[:5]

COUNTY
1    19491
3       12
5       52
7      276
9       89
Name: Vehicles, dtype: int64

In [42]:
df = pd.DataFrame(tot_v_per_county)
df.rename(columns={'Vehicles':'Total Vehicles'}, inplace=True)
df.head()

        Total Vehicles
COUNTY
1              1271376
3                 6744
5                43434
7               201388
9                56092

In [48]:
df2 = df.join(be_count_per_county)
df2.rename(columns={'Vehicles':'Battery Vehicles'}, inplace=True)
df2.head()

        Total Vehicles  Battery Vehicles
COUNTY
1              1271376           19491.0
3                 6744              12.0
5                43434              52.0
7               201388             276.0
9                56092              89.0

In [51]:
df2['Batter Pct'] = df2['Battery Vehicles'] / df2['Total Vehicles'] * 100
df2.head()

        Total Vehicles  Battery Vehicles  Batter Pct
COUNTY
1              1271376           19491.0    1.533063
3                 6744              12.0    0.177936
5                43434              52.0    0.119722
7               201388             276.0    0.137049
9                56092              89.0    0.158668

In [53]:
# do same for Plug in Hybrid
condition = cars_cleaned['Fuel'] == 'Plug-in Hybrid'
plugin = cars_cleaned[condition]
plugin_count_per_county = plugin.groupby('COUNTY')['Vehicles'].sum()
plugin_count_per_county.name = 'Plug-in Vechicles'
plugin_count_per_county[:5]

COUNTY
1    13535
3       10
5       77
7      350
9      103
Name: Plug-in Vechicles, dtype: int64

In [56]:
df3.head()

        Total Vehicles  Battery Vehicles  Batter Pct  Plug-in Vechicles
COUNTY
1              1271376           19491.0    1.533063              13535
3                 6744              12.0    0.177936                 10
5                43434              52.0    0.119722                 77
7               201388             276.0    0.137049                350
9                56092              89.0    0.158668                103

In [61]:
df3 = df2.join(plugin_count_per_county)
df3['Plug-in Pct'] = df3['Plug-in Vechicles'] / df3['Total Vehicles'] * 100
df3.head()

,Total Vehicles,Battery Vehicles,Batter Pct,Plug-in Vechicles,Plug-in Pct
COUNTY,,,,,
1,1271376,19491.0,1.533063,13535,1.064595
3,6744,12.0,0.177936,10,0.148280
5,43434,52.0,0.119722,77,0.177280
7,201388,276.0,0.137049,350,0.173794
9,56092,89.0,0.158668,103,0.183627

In [64]:
# do same for Hybrid Gasoline
condition = cars_cleaned['Fuel'] == 'Hybrid Gasoline'
hg = cars_cleaned[condition]
hg_count_per_county = hg.groupby('COUNTY')['Vehicles'].sum()
hg_count_per_county.name = 'Hybrid Gas Vechicles'
hg_count_per_county[:5]

COUNTY
1    66423
3      111
5      749
7     4551
9     1030
Name: Hybrid Gas Vechicles, dtype: int64

In [65]:
df4 = df3.join(hg_count_per_county)
df4['Hybrid Gas Pct'] = df4['Hybrid Gas Vechicles'] / df4['Total Vehicles'] * 100
df4.head()

,Total Vehicles,Battery Vehicles,Batter Pct,Plug-in Vechicles,Plug-in Pct,Hybrid Gas Vechicles,Hybrid Gas Pct
COUNTY,,,,,,,
1,1271376,19491.0,1.533063,13535,1.064595,66423,5.224497
3,6744,12.0,0.177936,10,0.148280,111,1.645907
5,43434,52.0,0.119722,77,0.177280,749,1.724455
7,201388,276.0,0.137049,350,0.173794,4551,2.259817
9,56092,89.0,0.158668,103,0.183627,1030,1.836269